---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
MemberForcesServiceData Properties
MemberForcesServiceData Class See Also Send Feedback
---

The MemberForcesServiceData type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Document | The current document. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

MemberForcesServiceData Class

Autodesk.Revit.DB.Structure Namespace